CREATE DATABASE  IF NOT EXISTS `dogtorYJ2` /*!40100 DEFAULT CHARACTER SET utf8 */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `dogtorYJ2`;
-- MySQL dump 10.13  Distrib 8.0.22, for macos10.15 (x86_64)
--
-- Host: localhost    Database: dogtorYJ2
-- ------------------------------------------------------
-- Server version	8.0.23

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `Feed`
--

DROP TABLE IF EXISTS `Feed`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Feed` (
  `fNo` int NOT NULL AUTO_INCREMENT,
  `fSubmitDate` varchar(45) NOT NULL,
  `fContent` varchar(200) NOT NULL,
  `fWriter` varchar(50) NOT NULL,
  `fHashTag` varchar(1000) DEFAULT 'none',
  PRIMARY KEY (`fNo`)
) ENGINE=InnoDB AUTO_INCREMENT=51 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Feed`
--

LOCK TABLES `Feed` WRITE;
/*!40000 ALTER TABLE `Feed` DISABLE KEYS */;
INSERT INTO `Feed` VALUES (43,'2021-08-13 07:41:57','세상억울한 표정~ㅋㅋㅋㅋ[__empty_space__][__empty_space__]웰시코기가 한없이 하죠 ^^','wowJJang','건강챙겨 간식주께'),(44,'2021-08-13 08:23:01','병원다녀왂더니 화가 잔뜩..[__empty_space__][__empty_space__]고기라고 챙겨줘야 안삐지려나 ㅠㅠ','ghfhg','왕삐짐 간식은안돼\r\n'),(45,'2021-08-13 08:24:05','저희 아가 다 나았답니다^^','gg','건강최고 맘껏놀쟈\r\n'),(46,'2021-08-13 08:36:32','강아지도 체온확인 필수인라네요..[__empty_space__][__empty_space__]시국이 시국입니다 힘내세요!','alksjdhf','이시국 힘내요 감사합니다'),(47,'2021-08-13 08:49:27','저희지 솜뭉치 ^^','wowJJang','성질은더러움 잘때가제일이쁨 망나니왕자'),(48,'2021-08-13 08:56:19','시고르잡종 삼형제입니다[__empty_space__][__empty_space__]흰콩은 쌧고 단 3분만 유지됩니다','wowJJang','솜뭉치 사고뭉치\r\n'),(49,'2021-08-13 11:10:19','놀러가고 싶네요','wowJJang','1 2 3 4'),(50,'2021-08-13 11:13:15','힝구힝구','wowJJang','사실은 백구');
/*!40000 ALTER TABLE `Feed` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `FeedComment`
--

DROP TABLE IF EXISTS `FeedComment`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `FeedComment` (
  `cNo` int NOT NULL AUTO_INCREMENT,
  `cWriter` varchar(50) NOT NULL,
  `cSubmitDate` datetime NOT NULL,
  `cRecomment` varchar(45) DEFAULT NULL,
  `cContent` varchar(200) NOT NULL,
  `fNo` int NOT NULL,
  PRIMARY KEY (`cNo`),
  KEY `fk_fno_idx` (`fNo`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `FeedComment`
--

LOCK TABLES `FeedComment` WRITE;
/*!40000 ALTER TABLE `FeedComment` DISABLE KEYS */;
INSERT INTO `FeedComment` VALUES (1,'윤재필','2021-08-13 11:24:33',NULL,'저도 좋아요',50);
/*!40000 ALTER TABLE `FeedComment` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `FeedImage`
--

DROP TABLE IF EXISTS `FeedImage`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `FeedImage` (
  `fiNo` int NOT NULL AUTO_INCREMENT,
  `fiName` varchar(50) NOT NULL,
  `fNo` int NOT NULL,
  PRIMARY KEY (`fiNo`),
  KEY `fk_fno_idx` (`fNo`),
  CONSTRAINT `fk_fno` FOREIGN KEY (`fNo`) REFERENCES `Feed` (`fNo`) ON DELETE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=45 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `FeedImage`
--

LOCK TABLES `FeedImage` WRITE;
/*!40000 ALTER TABLE `FeedImage` DISABLE KEYS */;
INSERT INTO `FeedImage` VALUES (37,'9DE1829A-DEAA-4D65-92EE-09951B7B741C.jpeg',43),(38,'EF5665DB-401B-497C-8703-E131CF265B9E.jpeg',44),(39,'8B3020E3-466E-4974-A7D3-1A3A6D7E343A.jpeg',45),(40,'11A52C7A-6FFC-498B-B6FD-ABB32EE9FE01.jpeg',46),(41,'1F3AE047-F9B1-4990-B111-CF34E5C9966B.jpeg',47),(42,'57647FD1-9CA2-4B31-9405-492CDDB1294C.jpeg',48),(43,'3FCCC789-AC6F-4E66-B3B1-2810CBFA2B85.jpeg',49),(44,'51D51954-B66B-4F7B-AFCB-7C4A9AB27D3A.jpeg',50);
/*!40000 ALTER TABLE `FeedImage` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Hospital`
--

DROP TABLE IF EXISTS `Hospital`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Hospital` (
  `HospitalID` bigint NOT NULL,
  `HospitalName` varchar(50) NOT NULL,
  `Location` varchar(100) NOT NULL,
  `Lat` decimal(15,13) NOT NULL,
  `Long` decimal(15,12) NOT NULL,
  PRIMARY KEY (`HospitalID`),
  UNIQUE KEY `HospitalID_UNIQUE` (`HospitalID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Hospital`
--

LOCK TABLES `Hospital` WRITE;
/*!40000 ALTER TABLE `Hospital` DISABLE KEYS */;
INSERT INTO `Hospital` VALUES (11493624,'대형동물병원','서울특별시 강북구 삼양로 504',37.6479895269989,127.014659497802),(11528677,'혜인종합동물병원본점','서울특별시 양천구 등촌로 218',37.5491496872781,126.863898339739),(11545405,'남산동물병원','서울특별시 용산구 후암로 51',37.5504361058196,126.976999734084),(11581036,'라파엘동물병원','서울특별시 서초구 강남대로 525-3 호림빌딩',37.5087972416546,127.021933251943),(11590767,'독립문동물병원','서울특별시 서대문구 통일로 171-1',37.5690889256072,126.963204254761),(11598111,'이윤세동물병원','서울특별시 성동구 행당로 76 생활편의시설',37.5562490965386,127.027528129786),(11599472,'동물을사랑하는사람들','서울특별시 강북구 도봉로98길 56',37.6408979528152,127.032707702561),(11602647,'망원 동물병원','서울특별시 마포구 월드컵로 65',37.5548617618262,126.910869330338),(11611015,'이태원동물병원','서울특별시 용산구 녹사평대로 210',37.5363970187756,126.987217832475),(11615298,'빛가온동물병원','서울특별시 서대문구 통일로 375',37.5835523880799,126.949292868145),(11639369,'마음을나누는동물병원','서울특별시 서대문구 신촌로35길 10 e편한세상신촌 상가 B1',37.5586416507778,126.955972779768),(11689464,'차오름동물병원','서울특별시 용산구 효창원로 14',37.5342859288059,126.951140125709),(11702343,'보노보노 동물병원','서울특별시 강북구 삼양로 336',37.6334675743545,127.017744859649),(11712026,'북악동물병원','서울특별시 종로구 자하문로 293',37.5988797679473,126.960275720207),(11712567,'행복한 동물병원','서울특별시 도봉구 도봉로136길 7 한독패밀리타운',37.6593161840020,127.041652144370),(11713499,'행복한동물병원','서울특별시 마포구 월드컵북로 224',37.5698020382057,126.904699040069),(11714872,'올리브동물병원','서울특별시 종로구 자하문로 305',37.5992550373702,126.958978360226),(11731107,'하니동물의료센터','서울특별시 양천구 등촌로 58',37.5351347610340,126.863762359295),(11834396,'서울특별시수의사회','서울특별시 성북구 안암로 47-1',37.5813597211264,127.027277776295),(11856902,'필동물종합병원','서울특별시 양천구 등촌로 16',37.5313860847415,126.864097614546),(11872178,'박창석종합동물병원','서울특별시 마포구 도화길 42',37.5415127963155,126.950359072273),(11879134,'월드펫동물종합병원','서울특별시 마포구 신촌로 248',37.5570349717626,126.953337975021),(11883258,'맑은동물병원','서울특별시 동대문구 청계천로 417 청계천대성스카이렉스 1-108호',37.5720071392864,127.023906598956),(12007963,'디오빌동물병원','서울특별시 영등포구 당산로 222 당산디오빌',37.5332447828491,126.902291122854),(12028185,'늘푸른동물병원','서울특별시 은평구 은평로 29',37.5982682452038,126.911001816146),(12047069,'24시센트럴동물메디컬센터','서울특별시 성동구 고산자로 207 1층',37.5586754032620,127.033736509137),(12049763,'삼성동물병원','서울특별시 강북구 삼양로19길 25 삼성래미안트리베라1차아파트 110동 상가',37.6156943247238,127.021139026425),(12279663,'홈펫 동물병원','서울특별시 강북구 도봉로 110-1 홈펫동물병원',37.6189201655786,127.029400117767),(12833138,'와우동물병원','서울특별시 마포구 월드컵북로 167 나디 빌딩',37.5670153009577,126.909797762062),(12883338,'나래동물병원','서울특별시 성북구 동소문로 66 김의원빌딩',37.5914030041092,127.012981904976),(12962129,'우리동물병원','서울특별시 종로구 지봉로 96-3',37.5787057061891,127.015644403060),(13023600,'바우미우동물병원','서울특별시 중구 다산로 175 명덕빌딩',37.5592821999279,127.012858171038),(13051212,'우리동물병원','서울특별시 서대문구 통일로 197',37.5709009395015,126.961300865861),(13089399,'평화와생명동물병원','서울특별시 성동구 행당로 76 생활편의시설',37.5562490965386,127.027528129786),(13094638,'VIP동물의료센터 성북점','서울특별시 성북구 동소문로 73 시티플레이스 2F, 1F,1B',37.5922964697932,127.013412557348),(13106994,'퓨리나 동물병원','서울특별시 도봉구 도봉로 469',37.6476184727601,127.033703271868),(13107227,'오렌지동물병원','서울특별시 성동구 행당로8길 41-2',37.5560354167817,127.033960988388),(13110987,'큐동물병원','서울특별시 성북구 장위로 81',37.6139864826618,127.045700995687),(13118859,'리즈동물병원','서울특별시 서초구 잠원로 221 한강상가 103, 201호',37.5209597360751,127.015534149102),(13119805,'금강동물병원','서울특별시 용산구 이촌로 300 렉스상가',37.5178439903271,126.980323377172),(13140688,'누리봄동물병원','서울특별시 종로구 사직로12길 2',37.5757930764048,126.971069775888),(13150799,'신영동물병원','서울특별시 서대문구 통일로 489',37.5916948248344,126.940931668368),(13152805,'서교동물병원','서울특별시 마포구 포은로 107 2층',37.5565811554485,126.904555510728),(13152935,'이황동물병원','서울특별시 마포구 월드컵로 147 한익빌딩',37.5607966710773,126.905478560614),(13153597,'홍제동물병원','서울특별시 서대문구 통일로 463',37.5896244224324,126.942734489087),(13155070,'셀레네동물병원','서울특별시 마포구 독막로 85',37.5477716665856,126.922409857908),(13161433,'서울종합동물병원','서울특별시 성북구 보문로 137 성균빌딩',37.5871059357470,127.018177675408),(13179973,'중앙동물병원','서울특별시 강북구 도봉로 88',37.6169686486072,127.030375933428),(13427118,'북아현동물병원','서울특별시 서대문구 신촌로 289-1',37.5575552547535,126.958278485536),(13573586,'마리동물병원','서울특별시 마포구 신촌로 16',37.5579923498279,126.928159187640),(13578588,'웰케어동물병원','서울특별시 마포구 월드컵북로 27 이화빌딩',37.5568752831723,126.919089470714),(13586909,'동물메디컬센터W','서울특별시 마포구 월드컵로 46',37.5534655733354,126.912309727504),(17907925,'위즈동물병원','서울특별시 강북구 도봉로 202',37.6267275977188,127.026273795574),(17938873,'호동물병원','서울특별시 강북구 월계로 53',37.6120233028697,127.035536721664),(17941243,'솔샘동물병원','서울특별시 강북구 삼양로27길 19 204동 108호(미아동, 삼성래미안트리베라 2차 상가',37.6161238065432,127.021741379374),(17944379,'강북동물병원','서울특별시 강북구 오현로 194',37.6288359683906,127.039873780530),(17965215,'이앤김동물병원','서울특별시 도봉구 마들로 664 킴스타워 2층 이N김동물병원',37.6694286200145,127.046459254284),(17991721,'신창동물병원','서울특별시 도봉구 덕릉로 230',37.6382574737839,127.037996921242),(18005270,'유림동물병원','서울특별시 노원구 월계로45길 28',37.6268415975561,127.050970904678),(18042841,'대한동물병원','서울특별시 중구 퇴계로 227-1',37.5621092873383,126.996932842084),(18048249,'황동물병원','서울특별시 중구 퇴계로 254-1',37.5623648498155,126.999989134353),(18050315,'동물병원','서울특별시 중구 퇴계로 226',37.5616329283639,126.996855331452),(18066270,'수락동물병원','서울특별시 노원구 동일로 1622',37.6729939030577,127.055968051668),(18074994,'한빛종합동물병원','서울특별시 노원구 동일로 1370',37.6509128734287,127.061845828421),(18076227,'그린동물병원','서울특별시 노원구 노원로 540',37.6614238754662,127.059282318121),(18121040,'미래지동물의료센터','서울특별시 중구 다산로 107',37.5536619054708,127.009622335265),(18127357,'한사랑동물병원','서울특별시 용산구 신흥로 36-1',37.5417078928026,126.987392312376),(18191611,'한남동물병원','서울특별시 용산구 대사관로24길 28',37.5324238174709,127.005298391923),(18195363,'21세기동물병원','서울특별시 용산구 보광로 46 용호빌딩',37.5283158173314,126.999195515819),(18199503,'라온동물병원','서울특별시 용산구 회나무로13길 6',37.5396436432414,126.989559698561),(18258719,'길음동물병원','서울특별시 성북구 동소문로 248 102동 106호',37.6031839105630,127.024823216768),(18285553,'행복한동물병원','서울특별시 성북구 돌곶이로 91',37.6111797679712,127.056423427765),(18301805,'CT종합동물병원','서울특별시 마포구 만리재로 74',37.5464841809251,126.958879198129),(18313627,'24시 루시드동물메디컬센터','서울특별시 강북구 월계로 3 덕신빌딩4층',37.6095747937536,127.030649608849),(18314692,'ZOO동물병원','서울특별시 성북구 정릉로 328',37.6019983890365,127.019541243545),(18323812,'용강동물병원','서울특별시 마포구 대흥로 48',37.5448331277830,126.939474759710),(18326695,'굿모닝동물병원','서울특별시 마포구 독막로 295 삼부골든타워',37.5447553941086,126.946025717970),(18330154,'디엔씨동물병원','서울특별시 마포구 신촌로 154',37.5563590232996,126.942654589244),(18348345,'뉴욕동물병원','서울특별시 마포구 양화로 68',37.5507566794649,126.916093445626),(18382912,'상암동물병원','서울특별시 마포구 월드컵북로 336',37.5760571457487,126.894675867037),(18607553,'종합동물병원','서울특별시 강북구 도봉로98길 56',37.6408979528152,127.032707702561),(18609687,'현대종합동물병원','서울특별시 강북구 노해로 94',37.6437724827899,127.023050428664),(18678010,'대학로동물병원','서울특별시 종로구 창경궁로 261',37.5846451917256,127.000183299208),(18679431,'해동물병원','서울특별시 종로구 지봉로 53-1',37.5749038873818,127.015515348925),(18712504,'이수의과동물병원','서울특별시 용산구 후암로 13-2',37.5472299867650,126.977914833218),(18719351,'열린동물병원','서울특별시 용산구 원효로 171',37.5356258493379,126.961761152897),(19972196,'웰펫동물병원','서울특별시 중구 동호로 178',37.5542668528006,127.011447417836),(19998054,'아프리카동물병원','서울특별시 용산구 후암로 32 현석빌딩',37.5487053771864,126.977941217590),(20005885,'원효동물병원','서울특별시 용산구 원효로 187 송원빌딩',37.5364370098966,126.963145855106),(20043261,'시마동물병원','서울특별시 노원구 동일로 1356 주공4단지 상가 402동2층',37.6498808620377,127.062236934343),(20070835,'펫 동물병원','서울특별시 용산구 백범로 285',37.5395911118135,126.961087246982),(20277606,'금호동물병원','서울특별시 성동구 금호로 105',37.5523763631514,127.024553084225),(20278106,'한사랑동물병원','서울특별시 성북구 성북로 27 동방빌딩',37.5903521074550,127.003842217563),(20584599,'24시 예스 동물병원','서울특별시 서초구 잠원로 24 반포자이주구중심상가1동',37.5071156980651,127.009873208557),(20885860,'엉클장동물병원','서울특별시 용산구 백범로 341 리첸시아 용산 A동 106호',37.5379386735674,126.967973433167),(21015302,'박효리군동물병원','서울특별시 마포구 포은로 64',37.5528876481087,126.906522013543),(21017003,'달래동물의료센터','서울특별시 용산구 한남대로 76 한남프라자 2층 동물병원',37.5355614904423,127.006549413089),(21059777,'나무동물병원','서울특별시 동작구 흑석한강로 2 센트레빌1차상가 105호',37.5065990536717,126.966516645021),(21235945,'우리아이 동물병원','서울특별시 동작구 상도로 262',37.5038499265622,126.946902829407),(21295487,'민트동물병원','서울특별시 용산구 원효로 51 삼성테마트',37.5338633624590,126.950070316419),(21642040,'두리틀동물병원','서울특별시 서대문구 응암로 66 서우빌딩 2층',37.5788417081699,126.910800451007),(31259517,'그레이스동물병원','서울특별시 강남구 학동로6길 18',37.5106275585019,127.024159932926),(31368220,'캣&덴탈 하이디 동물병원','서울특별시 마포구 월드컵로3길 14 마포한강2차푸르지오 상업시설 123호',37.5510079695241,126.911648997870),(31591956,'안박동물병원','서울특별시 강서구 양천로 510 현대프린스텔',37.5601170390069,126.856339450696),(31699519,'푸른들동물병원','서울특별시 강서구 양천로 663-1 푸른들동물병원',37.5521993901211,126.870800704542),(31744453,'봉식동물병원','서울특별시 강북구 삼양로 252',37.6258469200137,127.018477215618),(31798363,'24시 스마트 동물메디컬센터','서울특별시 은평구 은평로 93',37.5997853553252,126.918126796920),(31936689,'365동물병원','서울특별시 도봉구 방학로 54 영하빌딩',37.6629757493846,127.046350849475),(31949507,'라임동물병원','서울특별시 성동구 무학로 16',37.5655085857988,127.030325596719),(31992363,'힐링동물병원','서울특별시 마포구 백범로31길 7 101동 104호',37.5452627685789,126.948702442910),(32052801,'홍익동물종합병원','서울특별시 마포구 독막로 45',37.5481002592998,126.918397803393),(32085223,'함께하는동물병원','서울특별시 성동구 독서당로 200',37.5430214037360,127.013125704134),(32090945,'안암종합동물병원','서울특별시 동대문구 안암로 40',37.5805624542181,127.026786374539),(32093792,'드림동물병원','서울특별시 성북구 동소문로 74',37.5918355795290,127.013698489668),(32094270,'포유동물병원','서울특별시 성북구 오패산로 22',37.6042201573370,127.037684366424),(32116370,'정겨운동물병원','서울특별시 동작구 상도로 315 상정빌딩',37.5000179900274,126.950740638661),(32244071,'이상윤동물병원','서울특별시 용산구 이촌로 248 한강맨션',37.5193865878083,126.975025954742),(32244290,'보광동물병원','서울특별시 용산구 보광로 22-1',37.5265268781588,127.000780028964),(32358844,'Pet365 동물병원','서울특별시 성동구 독서당로 328 김진산부인과',37.5478953636281,127.025283319450),(32429751,'동물병원 메이','서울특별시 용산구 대사관로 41 코트디부와르대사관저',37.5337458522953,127.002783144575),(32505054,'호담동물병원','서울특별시 성북구 동소문로 302 숭인회관',37.6067864914959,127.028533160779),(32582010,'도화동물병원','서울특별시 마포구 삼개로 28',37.5378114151592,126.947279523422),(32762566,'아이엠동물병원','서울특별시 마포구 양화로 72 서교동 효성해링턴타워 1층 121호',37.5508021700653,126.916715922466),(32891393,'오라고동물병원','서울특별시 양천구 공항대로 552 대우마이빌 1층 오라고동물병원',37.5495540187440,126.866949534355),(33142287,'하비동물병원','서울특별시 도봉구 노해로65길 14',37.6520344268197,127.046523773308),(33176768,'아지동물병원','서울특별시 성동구 독서당로 289',37.5480363910241,127.021041936501),(33372964,'가로수동물병원','서울특별시 강남구 압구정로 134',37.5243501514978,127.023513088969),(33510563,'퍼스동물병원','서울특별시 용산구 신흥로 54',37.5431139475175,126.987819008334),(34212406,'펫탑','서울특별시 용산구 후암로4길 7 지층',37.5468181782353,126.978611116938),(34329244,'사랑의동물병원','서울특별시 강북구 솔샘로 184 SK 북한산시티 주상가동 209호',37.6199587236903,127.012851056561),(34348061,'브이케어 동물병원','서울특별시 서초구 강남대로79길 32 1층',37.5047200921316,127.022473566310),(34348127,'옥수수동물병원','서울특별시 성동구 독서당로40길 39',37.5417089096844,127.017974967673),(34581541,'워너비동물병원','서울특별시 마포구 동교로 193',37.5576991224283,126.922533792965),(34582054,'별난동물병원','서울특별시 도봉구 도봉로 603',37.6586084835715,127.040295531744),(34615852,'두암한방동물병원','서울특별시 양천구 목동중앙북로 73 덕수프라자 207호',37.5468366988388,126.871505783093),(34678177,'도담도담동물병원','서울특별시 성북구 화랑로 76',37.6018277386458,127.040463515854),(34786660,'24시아프리카동물메디컬센터','서울특별시 강서구 공항대로 335 경왕빌딩',37.5582028449804,126.844922731223),(34984268,'닥터K','서울특별시 마포구 월드컵북로 347 메디컬빌딩 1층',37.5763454139490,126.893216249483),(35021584,'유케어종합동물병원','서울특별시 동작구 상도로 214',37.5049722037623,126.942446008568),(35044705,'카카오N동물병원','서울특별시 성북구 길음로 33 길음뉴타운8단지아파트',37.6050492482263,127.022009385841),(35258159,'스머프동물병원','서울특별시 은평구 백련산로 145',37.5982248612282,126.925077475626),(35258175,'아프지말게동물병원','서울특별시 마포구 월드컵북로 381 상암 월드컵파크 4단지',37.5779528826091,126.889887582062),(35307431,'좋아요동물병원','서울특별시 중구 다산로36길 83',37.5605240092380,127.019105751275),(35356949,'강북24시N동물의료센터','서울특별시 성북구 삼양로4길 3',37.6058166083792,127.024368375123),(35516033,'리베동물메디컬센터','서울특별시 양천구 오목로 280',37.5252183808070,126.868240449856),(35523852,'웰니스 클리닉 청계천점','서울특별시 중구 청계천로 400 이마트 청계천점 지하1층',37.5708105464699,127.021463886656),(35678303,'세무회계 다온','서울특별시 마포구 백범로31길 8 오피스201동 510~511호',37.5449853625619,126.949355551939),(35726864,'청화종합동물병원','서울특별시 용산구 보광로 90',37.5311977731211,126.995634393831),(35807122,'지엔동물병원','서울특별시 동작구 상도로 252 명승 빌딩 2층',37.5044226915165,126.946295662235),(35831937,'건강한동물병원','서울특별시 마포구 만리재로 15 제일빌딩',37.5445849310546,126.952767730440),(36161217,'텐즈힐링동물병원','서울특별시 성동구 마장로 137 텐즈힐',37.5678250213491,127.025053595952),(36250175,'남산동물병원','서울특별시 중구 다산로 32 남산타운아파트 5상가 217호',37.5471667734011,127.005677166122),(36266186,'강서YD동물의료센터','서울특별시 강서구 화곡로 371',37.5569557920247,126.852242114111),(36302234,'백슬동물병원','서울특별시 중구 만리재로 177 서울역한라비발디센트럴 105호',37.5544616759483,126.965836695454),(36314871,'좋아서하는동물병원','서울특별시 용산구 백범로 341 리첸시아 용산',37.5379386735674,126.967973433167),(36399715,'스마트동물병원','서울특별시 강북구 솔샘로 203-2 미양피아노학원',37.6202980076724,127.015347620788),(36667560,'이든동물의료센터','서울특별시 영등포구 양평로 5 성원빌딩',37.5320958900437,126.905019474298),(36721088,'우리동물병원생명사회적협동조합','서울특별시 마포구 월드컵북로12길 22 우리동물병원생명사회적협동조합',37.5620506346922,126.915776770909),(36729502,'몰리스펫샵 이마트월계점','서울특별시 노원구 마들로3길 15 이마트월계점 2F',37.6265093604229,127.061979778612),(36786130,'헬릭스동물메디컬센터','서울특별시 서초구 신반포로 162 강남귀금속타운',37.5048884433907,127.002280487802),(36798000,'H동물병원','서울특별시 강북구 삼양로27길 35-21 106호',37.6179766319717,127.018934343303),(36823717,'압구정웰동물병원','서울특별시 강남구 압구정로 108 덕산빌딩',37.5228889090644,127.020600022676),(36873956,'헬로우동물병원','서울특별시 서대문구 연희로 178',37.5727774650447,126.935734565210),(36878541,'동물병원 위드','서울특별시 강북구 덕릉로 79',37.6347982202667,127.022602638980),(36893484,'그린동물병원','서울특별시 동대문구 정릉천동로 58 상가 125호',37.5771639451575,127.035809390442),(37005936,'넬동물병원','서울특별시 성북구 오패산로 75-1',37.6088188628780,127.035774842820),(37027337,'꿈의숲동물병원','서울특별시 성북구 돌곶이로 220 코오롱하늘채상가 105동 112호',37.6189867339093,127.046528885296),(37036347,'창문동물병원','서울특별시 강북구 월계로 35 창문동물병원',37.6111386011349,127.033765856462),(37168859,'제이에스메디칼','서울특별시 강북구 노해로23길 14 1층',37.6444491698481,127.022332263452),(37171801,'화신종합동물병원','서울특별시 도봉구 도당로 63',37.6637906450586,127.034666245526),(37297940,'애니케어동물병원','서울특별시 강북구 삼양로 499',37.6477621665227,127.014269995354),(37362184,'어울림동물병원','서울특별시 서대문구 가재울미래로 2 DMC 파크뷰자이 104동 1층 102A호',37.5744203632344,126.917897379411),(37371383,'산들산들 동물병원','서울특별시 마포구 마포대로16길 7',37.5509746252370,126.956497177398),(37383519,'오즈동물병원','서울특별시 서대문구 증가로 150 상가동 B209, B210호 오즈동물병원',37.5332447828491,126.902291122854),(37410259,'방학동물병원','서울특별시 도봉구 도봉로 723',37.6690967638221,127.043207045737),(37411814,'월드펫동물병원','서울특별시 종로구 진흥로 477-1',37.6060305702047,126.960820387240),(37437853,'한솔동물병원','서울특별시 서대문구 통일로 392',37.5849343149835,126.948629832086),(37445511,'와이즈24시동물병원','서울특별시 강남구 학동로6길 7',37.5112580472271,127.023884947783),(37454773,'닥터호오 동물병원','서울특별시 마포구 대흥로 24 서강빌딩',37.5430369692613,126.937881524287),(37489162,'쓰담쓰담동물병원','서울특별시 성북구 종암로 113',37.6001558298535,127.033676301313),(37565663,'바른동물병원','서울특별시 중구 퇴계로 447 황학아크로타워 1층 131호 바른동물병원',37.5660419798503,127.021721835241),(37615742,'앙리 동물병원','서울특별시 성북구 성북로 66 농협',37.5933929157840,127.001707407201),(37620465,'키다리동물병원','서울특별시 마포구 월드컵북로 218',37.5695010772358,126.904998936389),(37630099,'오석헌동물병원','서울특별시 성동구 매봉길 15 래미안 옥수 리버젠',37.5460669857828,127.013705839408),(37641934,'광화문동물병원','서울특별시 종로구 자하문로 35-3 1층',37.5790436149798,126.971158066620),(37648561,'펫토이동물병원','서울특별시 용산구 대사관로 32',37.5335238663304,127.001691785742),(37793393,'태일동물병원','서울특별시 도봉구 해등로 184',37.6579277065655,127.036400395433),(37812675,'스마트동물병원','서울특별시 노원구 노원로 470 금녕빌딩',37.6584326123212,127.065750939818),(37896293,'워너비동물병원 용산점','서울특별시 용산구 서빙고로 35 101동 101호',37.5247695394853,126.968610877882),(38339059,'유림동물안과병원','서울특별시 서초구 강남대로 631 크레신타워',37.5181076357879,127.018487719889),(38703962,'바다동물병원','서울특별시 용산구 서빙고로 69 파크타워 B21',37.5237113460813,126.972351473155),(38724604,'스마트동물병원 길음점','서울특별시 성북구 길음로13길 22 두산위브상가 103호',37.6094417730405,127.019323702394),(71879325,'웨스턴 동물의료센터','서울특별시 마포구 신촌로 110',37.5551568830554,126.938134366098),(96071102,'쿠키동물병원','서울특별시 강북구 삼양로27길 19 삼성래미안트리베라아파트',37.6161238065432,127.021741379374),(140521340,'바라봄동물병원','서울특별시 성동구 왕십리로 410 센트라스',37.5665904987620,127.024082463220),(162405817,'닥터스종합동물병원','서울특별시 노원구 월계로 336 상천빌딩 1층 닥터스종합동물병원',37.6291772173172,127.057826925002),(244035290,'트윈스동물병원','서울특별시 도봉구 도봉로110다길 20 1, 2층',37.6019983890365,127.019541243545),(261525496,'라온동물병원','서울특별시 마포구 월드컵북로 151',37.5660011117158,126.910827649233),(322237762,'바른펫 동물의료센터','서울특별시 강북구 노해로 65',37.6414453106283,127.022214548116),(426128598,'베이동물병원','서울특별시 용산구 이촌로 248 한강맨션 11동 102호',37.5193865878083,126.975025954742),(439257685,'24시 시유동물메디컬센터','서울특별시 용산구 이촌로64길 24',37.5200049152766,126.969871897307),(735307439,'스테이동물병원','서울특별시 성동구 매봉길 50 옥수 파크힐스상가 B1층 102호',37.5472954910899,127.012120225623),(754827202,'롯데동물병원','서울특별시 노원구 동일로 1279',37.6430702786721,127.064011517969),(772853842,'푸른숲동물병원','서울특별시 마포구 월드컵로 98 서현빌딩',37.5574125252083,126.909265979387),(787751104,'윤신근동물병원','서울특별시 중구 퇴계로 226',37.5616329283639,126.996855331452),(852076746,'서진동물병원','서울특별시 마포구 신촌로 56',37.5564828843446,126.932231877574),(978140243,'소망동물병원','서울특별시 마포구 신촌로 258',37.5571010327315,126.954305134645),(1079092778,'은빛동물병원','서울특별시 노원구 동일로 1649 윤일빌딩 1층 은빛동물병원',37.6756696167505,127.055042131693),(1083090860,'24시 로운동물의료센터','서울특별시 강서구 등촌로 223 2층',37.5496222380115,126.863410533802),(1084056199,'삼색이동물병원','서울특별시 마포구 독막로20나길 22 상가동 B106호',37.5460693945368,126.924894786748),(1089864154,'로이동물병원','서울특별시 성북구 아리랑로 27',37.5953563987273,127.015756252989),(1111865755,'서울준동물병원','서울특별시 마포구 대흥로24길 24 마포프레스티지자이상가 B동 107호',37.5539739756082,126.947661522663),(1113201042,'사랑동물병원','서울특별시 강북구 삼양로123길 6-12',37.6453755971713,127.015336689150),(1134997251,'초이스동물병원','서울특별시 강북구 삼양로117길 5',37.6434196905791,127.015720170082),(1148271896,'현대종합동물병원','서울특별시 도봉구 도봉로 669',37.6643162151208,127.042312187739),(1153724307,'수동물병원','서울특별시 노원구 동일로 1689',37.6791213093376,127.054950932229),(1176118381,'경희궁 바른 동물병원','서울특별시 종로구 송월길 99 경희궁자이 2단지 상가 2229호',37.5708610950823,126.962352257162),(1182104615,'원러브동물의료센터','서울특별시 성북구 돈암동 644-2',37.5992171221713,127.013788396259),(1188569390,'아이웰동물병원','서울특별시 마포구 백범로 130 1층 아이웰동물의료센터',37.5461578782207,126.945219125740),(1191628859,'한빛동물병원','서울특별시 성동구 금호산길 58 1층',37.5533486664033,127.019532381690),(1193147449,'보성통증동물병원','서울특별시 성북구 보국문로 68-1 1층',37.6105951684776,127.009366569889),(1195288494,'애니피플','서울특별시 마포구 성지길 25-11 471호 오구빌딩',37.5473650945265,126.914024249045),(1208233951,'사랑해요동물병원','서울특별시 도봉구 시루봉로 59',37.6561848633250,127.027720693373),(1218407026,'도담동물병원','서울특별시 도봉구 도봉로 875',37.6826627450157,127.045526793033),(1237387335,'이층애고양이동물병원','서울특별시 마포구 월드컵로 46 2층',37.5534655733354,126.912309727504),(1242314208,'다정다감 동물병원','서울특별시 동작구 만양로 11 1층 102호 다정다감 동물병원',37.5058646638827,126.946901515612),(1297590748,'한빛동물병원','서울특별시 도봉구 덕릉로 256',37.6401823756376,127.039794754283),(1301629610,'중앙동물병원','서울특별시 성북구 돌곶이로 56',37.6088434286525,127.059330823466),(1301995956,'날으는동물병원','서울특별시 마포구 마포대로11길 35',37.5489364214211,126.952161144333),(1308982645,'해봄동물병원','서울특별시 도봉구 도봉로180길 28 도봉투웨니퍼스트2단지',37.6828886494205,127.047508580816),(1309006953,'삼양동물병원','서울특별시 강북구 삼양로 190',37.6208354948612,127.020900910892),(1329983674,'W앤다솔','서울특별시 마포구 월드컵로 46 도서빌딩 2층',37.5534655733354,126.912309727504),(1341162926,'서울동물영상종양센터','서울특별시 중구 을지로38길 20',37.5658849050821,127.003340098559),(1370019353,'더편한동물병원','서울특별시 성북구 숭인로 50 108동 상가 2203호 더편한 동물병원',37.6119866708900,127.028783977420),(1419138741,'웰튼동물의료센터','서울특별시 중구 난계로 197 , 1층 2층 4층',37.5691132696745,127.023269297167),(1424848737,'빛가온동물병원','서울특별시 도봉구 마들로 695',37.6721926812374,127.046370183798),(1438510278,'둘리동물병원','서울특별시 도봉구 도봉로 506 1층',37.6503735124397,127.036095850767),(1454402997,'한아름동물병원','서울특별시 마포구 독막로 153 1층',37.5477244725140,126.930389501113),(1456505913,'콩닥동물의료센터','서울특별시 마포구 마포대로 127',37.5461944939177,126.952141283150),(1464647801,'유현동물병원','서울특별시 도봉구 방학로11길 10',37.6608821752950,127.031832809188),(1465913990,'웰니스동물병원','서울특별시 노원구 마들로3길 15',37.6265093604229,127.061979778612),(1475189852,'더싼동물병원','서울특별시 노원구 동일로 1363',37.6504403325764,127.061280549621),(1483774836,'커비동물병원','서울특별시 강남구 강남대로122길 47 보령빌딩 1F 104호',37.5089689839277,127.026695849559),(1491257733,'메종동물병원','서울특별시 중구 다산로 230',37.5635029907452,127.015962217644),(1493226503,'가나동물병원','서울특별시 도봉구 방학로 162',37.6627056680552,127.034101441062),(1508024035,'보듬동물병원','서울특별시 도봉구 해등로 255 신원에벤에셀 1층 121호',37.6573748589473,127.028191786525),(1508554197,'베이지동물병원','서울특별시 성동구 왕십리로 410 센트라스 110동상가 D동 106호',37.5665904987620,127.024082463220),(1524260394,'원스동물병원','서울특별시 용산구 청파로47길 16',37.5450084125936,126.969502901991),(1530044248,'바른동물병원','서울특별시 성동구 독서당로 272 상가동 206호 바른동물병원',37.5453300340479,127.017925368592),(1537525136,'24시 더힐동물의료센터','서울특별시 용산구 독서당로 81-1 3층',37.5346253251391,127.009564675619),(1567576526,'코덱소','서울특별시 종로구 창경궁로35길 38',37.5874160760924,127.002640897165),(1584343321,'블루핀동물병원','서울특별시 도봉구 마들로 548 블루핀아파트 102동 상가1층 102호,103호',37.6603213543822,127.049917808541),(1623571554,'24시애니동물병원','서울특별시 성북구 보문로 99 1층',37.5839929200316,127.019823992916),(1631123678,'올댓동물병원약품','서울특별시 중구 동호로11길 32',37.5539281879321,127.009149540808),(1643418548,'헬릭스동물암센터','서울특별시 중구 을지로38길 20',37.5658849050821,127.003340098559),(1652770776,'삼성동물병원','서울특별시 도봉구 도봉로 499',37.6501906699592,127.035311835472),(1654783302,'사랑동물병원','서울특별시 영등포구 선유로 146',37.5268517099864,126.891828818940),(1667032202,'퍼스트동물병원','서울특별시 성북구 한천로 713 래미안장위퍼스트하이 515동 상가 206, 207호',37.6212857858679,127.051719017992),(1679215047,'브라운동물병원','서울특별시 노원구 동일로203가길 29 브라운스톤중계 1층',37.6398759609875,127.064283759430),(1701569235,'VIP동물의료센터 노원점','서울특별시 노원구 동일로 1333',37.6478320601956,127.062343212353),(1728147858,'링크 동물의료센터','서울특별시 서대문구 신촌로 209',37.5571975461481,126.949270781080),(1744947507,'더벳한남동물병원','서울특별시 용산구 이태원로 227 1층',37.5356361792475,126.998853630936),(1748145841,'동물사랑동물병원','서울특별시 마포구 월드컵로 73 1층',37.5554229661709,126.910357684549),(1748991599,'다빈치동물병원','경기도 의정부시 평화로 205',37.7102516983097,127.047611667492),(1751973375,'애니컴메디컬센터','서울특별시 중구 다산로 83-1',37.5520852768816,127.008045472162),(1757369527,'참동물병원','서울특별시 노원구 동일로 1530',37.6650660864430,127.058023631956),(1762767769,'강북우리동물의료센터','서울특별시 도봉구 도봉로 586',37.6568596863776,127.040005149190),(1773641913,'조은동물병원','서울특별시 성동구 왕십리로 381',37.5645749434357,127.027889770087),(1778872013,'산책동물병원','서울특별시 마포구 창전로 50-1 1층',37.5468644288189,126.932650226433),(1786057960,'효창동물병원','서울특별시 용산구 백범로 293',37.5393265699350,126.961890742234),(1815868495,'다온동물병원','서울특별시 성동구 왕십리로 410 센트라스 J동135호',37.5665904987620,127.024082463220),(1821824370,'이을반려동물케어센터','서울특별시 서초구 사평대로20길 3 신화빌딩 1층',37.4991283924200,126.997212599411),(1831010489,'성신동물병원','서울특별시 성북구 아리랑로 18',37.5945180388131,127.016325296009),(1882215565,'우리들동물종합병원','서울특별시 노원구 동일로 1280',37.6434962139665,127.065740831728),(1925125042,'동물병원 품','서울특별시 동작구 양녕로 277-1 1층 동물병원 품',37.5043929759352,126.949396669191),(1929612293,'아이사랑동물병원','서울특별시 강북구 삼양로24길 19 현대성우아파트 아이사랑동물병원',37.6174496535601,127.021996503505),(1947497964,'꼬리','서울특별시 중구 세종대로9길 41 퍼시픽타워 7층',37.5613582316301,126.972996288210),(1960983655,'웰리스동물병원','서울특별시 노원구 섬밭로 258',37.6391097783726,127.064915087375),(1964025405,'선동물병원','서울특별시 종로구 자하문로 95',37.5844576666747,126.969998218268);
/*!40000 ALTER TABLE `Hospital` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `Pet`
--

DROP TABLE IF EXISTS `Pet`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `Pet` (
  `PetId` int NOT NULL AUTO_INCREMENT,
  `PetName` varchar(45) DEFAULT NULL,
  `PetImage` varchar(900) DEFAULT NULL,
  `PetSpecies` varchar(45) DEFAULT NULL,
  `PetGender` varchar(45) DEFAULT NULL,
  `PetAge` varchar(45) DEFAULT NULL,
  `User_Email` varchar(45) NOT NULL,
  PRIMARY KEY (`PetId`,`User_Email`),
  KEY `fk_Pet_User_idx` (`User_Email`),
  CONSTRAINT `fk_Pet_User` FOREIGN KEY (`User_Email`) REFERENCES `User` (`Email`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `Pet`
--

LOCK TABLES `Pet` WRITE;
/*!40000 ALTER TABLE `Pet` DISABLE KEYS */;
INSERT INTO `Pet` VALUES (8,'gg','DFFAE84E-1DAA-43A8-A1D8-1EE15AB04A45.jpeg','말티즈','남','22','ohyj0906@gmail.com'),(9,'ew232','pin2.png','퍼그','중성화','22','ohyj0906@gmail.com');
/*!40000 ALTER TABLE `Pet` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `User`
--

DROP TABLE IF EXISTS `User`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `User` (
  `Email` varchar(45) NOT NULL,
  `API` varchar(45) DEFAULT NULL,
  `Image` varchar(200) DEFAULT NULL,
  `NickName` varchar(45) DEFAULT NULL,
  PRIMARY KEY (`Email`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `User`
--

LOCK TABLES `User` WRITE;
/*!40000 ALTER TABLE `User` DISABLE KEYS */;
INSERT INTO `User` VALUES ('dbswovlf2009@gmail.com','Google','https://lh3.googleusercontent.com/a-/AOh14GhO_IOvKeqgGoM38EzRfD27QlnhJhZ-7lNhg7oC=s100','wowJJang'),('dbswovlf2009@naver.com',NULL,'vv.jpg','greenSky'),('kyj930415@gmail.com','Google','https://lh3.googleusercontent.com/a/AATXAJxQsav-Oxi5dsBiWZIxOjpjFwpyiMcb8WHIHnmH=s100','ghfhg'),('k_ye@naver.com','kakao','https://p.kakaocdn.net/th/talkp/wmtFqfwu4i/iP6nqqATnYmsN6KPtt9BH0/rf07we_110x110_c.jpg','gg'),('ohyj0906@gmail.com','Google','https://lh3.googleusercontent.com/a-/AOh14GgCsYaZ5p3xw-qxT-CJY1CaTskBvxMdHRoEKAGAqw=s100','alksjdhf');
/*!40000 ALTER TABLE `User` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-08-13 11:54:46
